loadtest/results/k6-mqon.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/upload-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 2m35s max duration (incl. graceful stop):
              * upload: Up to 10 looping VUs for 2m5s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
upload   [   1% ] 00/10 VUs  0m00.9s/2m05.0s

running (0m02.0s), 01/10 VUs, 1 complete and 0 interrupted iterations
upload   [   2% ] 01/10 VUs  0m01.9s/2m05.0s

running (0m03.0s), 02/10 VUs, 4 complete and 0 interrupted iterations
upload   [   2% ] 02/10 VUs  0m02.9s/2m05.0s

running (0m04.0s), 03/10 VUs, 9 complete and 0 interrupted iterations
upload   [   3% ] 03/10 VUs  0m03.9s/2m05.0s

running (0m05.0s), 04/10 VUs, 16 complete and 0 interrupted iterations
upload   [   4% ] 04/10 VUs  0m04.9s/2m05.0s

running (0m06.0s), 05/10 VUs, 25 complete and 0 interrupted iterations
upload   [   5% ] 05/10 VUs  0m05.9s/2m05.0s

running (0m07.0s), 06/10 VUs, 36 complete and 0 interrupted iterations
upload   [   6% ] 06/10 VUs  0m06.9s/2m05.0s

running (0m08.0s), 07/10 VUs, 49 complete and 0 interrupted iterations
upload   [   6% ] 07/10 VUs  0m07.9s/2m05.0s

running (0m09.0s), 08/10 VUs, 64 complete and 0 interrupted iterations
upload   [   7% ] 08/10 VUs  0m08.9s/2m05.0s

running (0m10.0s), 09/10 VUs, 81 complete and 0 interrupted iterations
upload   [   8% ] 09/10 VUs  0m09.9s/2m05.0s

running (0m11.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
upload   [   9% ] 10/10 VUs  0m10.9s/2m05.0s

running (0m12.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
upload   [  10% ] 10/10 VUs  0m11.9s/2m05.0s

running (0m13.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
upload   [  10% ] 10/10 VUs  0m12.9s/2m05.0s

running (0m14.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
upload   [  11% ] 10/10 VUs  0m13.9s/2m05.0s

running (0m15.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
upload   [  12% ] 10/10 VUs  0m14.9s/2m05.0s

running (0m16.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
upload   [  13% ] 10/10 VUs  0m15.9s/2m05.0s

running (0m17.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
upload   [  14% ] 10/10 VUs  0m16.9s/2m05.0s

running (0m18.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
upload   [  14% ] 10/10 VUs  0m17.9s/2m05.0s

running (0m19.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
upload   [  15% ] 10/10 VUs  0m18.9s/2m05.0s

running (0m20.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
upload   [  16% ] 10/10 VUs  0m19.9s/2m05.0s

running (0m21.0s), 10/10 VUs, 300 complete and 0 interrupted iterations
upload   [  17% ] 10/10 VUs  0m20.9s/2m05.0s

running (0m22.0s), 10/10 VUs, 320 complete and 0 interrupted iterations
upload   [  18% ] 10/10 VUs  0m21.9s/2m05.0s

running (0m23.0s), 10/10 VUs, 340 complete and 0 interrupted iterations
upload   [  18% ] 10/10 VUs  0m22.9s/2m05.0s

running (0m24.0s), 10/10 VUs, 358 complete and 0 interrupted iterations
upload   [  19% ] 10/10 VUs  0m23.9s/2m05.0s

running (0m25.0s), 10/10 VUs, 376 complete and 0 interrupted iterations
upload   [  20% ] 10/10 VUs  0m24.9s/2m05.0s

running (0m26.0s), 10/10 VUs, 396 complete and 0 interrupted iterations
upload   [  21% ] 10/10 VUs  0m25.9s/2m05.0s

running (0m27.0s), 10/10 VUs, 416 complete and 0 interrupted iterations
upload   [  22% ] 10/10 VUs  0m26.9s/2m05.0s

running (0m28.0s), 10/10 VUs, 434 complete and 0 interrupted iterations
upload   [  22% ] 10/10 VUs  0m27.9s/2m05.0s

running (0m29.0s), 10/10 VUs, 454 complete and 0 interrupted iterations
upload   [  23% ] 10/10 VUs  0m28.9s/2m05.0s

running (0m30.0s), 10/10 VUs, 472 complete and 0 interrupted iterations
upload   [  24% ] 10/10 VUs  0m29.9s/2m05.0s

running (0m31.0s), 10/10 VUs, 490 complete and 0 interrupted iterations
upload   [  25% ] 10/10 VUs  0m30.9s/2m05.0s

running (0m32.0s), 10/10 VUs, 510 complete and 0 interrupted iterations
upload   [  26% ] 10/10 VUs  0m31.9s/2m05.0s

running (0m33.0s), 10/10 VUs, 530 complete and 0 interrupted iterations
upload   [  26% ] 10/10 VUs  0m32.9s/2m05.0s

running (0m34.0s), 10/10 VUs, 550 complete and 0 interrupted iterations
upload   [  27% ] 10/10 VUs  0m33.9s/2m05.0s

running (0m35.0s), 10/10 VUs, 570 complete and 0 interrupted iterations
upload   [  28% ] 10/10 VUs  0m34.9s/2m05.0s

running (0m36.0s), 10/10 VUs, 590 complete and 0 interrupted iterations
upload   [  29% ] 10/10 VUs  0m35.9s/2m05.0s

running (0m37.0s), 10/10 VUs, 610 complete and 0 interrupted iterations
upload   [  30% ] 10/10 VUs  0m36.9s/2m05.0s

running (0m38.0s), 10/10 VUs, 630 complete and 0 interrupted iterations
upload   [  30% ] 10/10 VUs  0m37.9s/2m05.0s

running (0m39.0s), 10/10 VUs, 650 complete and 0 interrupted iterations
upload   [  31% ] 10/10 VUs  0m38.9s/2m05.0s

running (0m40.0s), 10/10 VUs, 670 complete and 0 interrupted iterations
upload   [  32% ] 10/10 VUs  0m39.9s/2m05.0s

running (0m41.0s), 10/10 VUs, 690 complete and 0 interrupted iterations
upload   [  33% ] 10/10 VUs  0m40.9s/2m05.0s

running (0m42.0s), 10/10 VUs, 710 complete and 0 interrupted iterations
upload   [  34% ] 10/10 VUs  0m41.9s/2m05.0s

running (0m43.0s), 10/10 VUs, 730 complete and 0 interrupted iterations
upload   [  34% ] 10/10 VUs  0m42.9s/2m05.0s

running (0m44.0s), 10/10 VUs, 750 complete and 0 interrupted iterations
upload   [  35% ] 10/10 VUs  0m43.9s/2m05.0s

running (0m45.0s), 10/10 VUs, 770 complete and 0 interrupted iterations
upload   [  36% ] 10/10 VUs  0m44.9s/2m05.0s

running (0m46.0s), 10/10 VUs, 790 complete and 0 interrupted iterations
upload   [  37% ] 10/10 VUs  0m45.9s/2m05.0s

running (0m47.0s), 10/10 VUs, 810 complete and 0 interrupted iterations
upload   [  38% ] 10/10 VUs  0m46.9s/2m05.0s

running (0m48.0s), 10/10 VUs, 826 complete and 0 interrupted iterations
upload   [  38% ] 10/10 VUs  0m47.9s/2m05.0s

running (0m49.0s), 10/10 VUs, 846 complete and 0 interrupted iterations
upload   [  39% ] 10/10 VUs  0m48.9s/2m05.0s

running (0m50.0s), 10/10 VUs, 865 complete and 0 interrupted iterations
upload   [  40% ] 10/10 VUs  0m49.9s/2m05.0s

running (0m51.0s), 10/10 VUs, 884 complete and 0 interrupted iterations
upload   [  41% ] 10/10 VUs  0m50.9s/2m05.0s

running (0m52.0s), 10/10 VUs, 904 complete and 0 interrupted iterations
upload   [  42% ] 10/10 VUs  0m51.9s/2m05.0s

running (0m53.0s), 10/10 VUs, 924 complete and 0 interrupted iterations
upload   [  42% ] 10/10 VUs  0m52.9s/2m05.0s

running (0m54.0s), 10/10 VUs, 940 complete and 0 interrupted iterations
upload   [  43% ] 10/10 VUs  0m53.9s/2m05.0s

running (0m55.0s), 10/10 VUs, 960 complete and 0 interrupted iterations
upload   [  44% ] 10/10 VUs  0m54.9s/2m05.0s

running (0m56.0s), 10/10 VUs, 980 complete and 0 interrupted iterations
upload   [  45% ] 10/10 VUs  0m55.9s/2m05.0s

running (0m57.0s), 10/10 VUs, 1000 complete and 0 interrupted iterations
upload   [  46% ] 10/10 VUs  0m56.9s/2m05.0s

running (0m58.0s), 10/10 VUs, 1020 complete and 0 interrupted iterations
upload   [  46% ] 10/10 VUs  0m57.9s/2m05.0s

running (0m59.0s), 10/10 VUs, 1040 complete and 0 interrupted iterations
upload   [  47% ] 10/10 VUs  0m58.9s/2m05.0s

running (1m00.0s), 10/10 VUs, 1060 complete and 0 interrupted iterations
upload   [  48% ] 10/10 VUs  0m59.9s/2m05.0s

running (1m01.0s), 10/10 VUs, 1080 complete and 0 interrupted iterations
upload   [  49% ] 10/10 VUs  1m00.9s/2m05.0s

running (1m02.0s), 10/10 VUs, 1100 complete and 0 interrupted iterations
upload   [  50% ] 10/10 VUs  1m01.9s/2m05.0s

running (1m03.0s), 10/10 VUs, 1120 complete and 0 interrupted iterations
upload   [  50% ] 10/10 VUs  1m02.9s/2m05.0s

running (1m04.0s), 10/10 VUs, 1140 complete and 0 interrupted iterations
upload   [  51% ] 10/10 VUs  1m03.9s/2m05.0s

running (1m05.0s), 10/10 VUs, 1160 complete and 0 interrupted iterations
upload   [  52% ] 10/10 VUs  1m04.9s/2m05.0s

running (1m06.0s), 10/10 VUs, 1180 complete and 0 interrupted iterations
upload   [  53% ] 10/10 VUs  1m05.9s/2m05.0s

running (1m07.0s), 10/10 VUs, 1200 complete and 0 interrupted iterations
upload   [  54% ] 10/10 VUs  1m06.9s/2m05.0s

running (1m08.0s), 10/10 VUs, 1220 complete and 0 interrupted iterations
upload   [  54% ] 10/10 VUs  1m07.9s/2m05.0s

running (1m09.0s), 10/10 VUs, 1240 complete and 0 interrupted iterations
upload   [  55% ] 10/10 VUs  1m08.9s/2m05.0s

running (1m10.0s), 10/10 VUs, 1256 complete and 0 interrupted iterations
upload   [  56% ] 10/10 VUs  1m09.9s/2m05.0s

running (1m11.0s), 10/10 VUs, 1276 complete and 0 interrupted iterations
upload   [  57% ] 10/10 VUs  1m10.9s/2m05.0s

running (1m12.0s), 10/10 VUs, 1296 complete and 0 interrupted iterations
upload   [  58% ] 10/10 VUs  1m11.9s/2m05.0s

running (1m13.0s), 10/10 VUs, 1316 complete and 0 interrupted iterations
upload   [  58% ] 10/10 VUs  1m12.9s/2m05.0s

running (1m14.0s), 10/10 VUs, 1334 complete and 0 interrupted iterations
upload   [  59% ] 10/10 VUs  1m13.9s/2m05.0s

running (1m15.0s), 10/10 VUs, 1354 complete and 0 interrupted iterations
upload   [  60% ] 10/10 VUs  1m14.9s/2m05.0s

running (1m16.0s), 10/10 VUs, 1370 complete and 0 interrupted iterations
upload   [  61% ] 10/10 VUs  1m15.9s/2m05.0s

running (1m17.0s), 10/10 VUs, 1390 complete and 0 interrupted iterations
upload   [  62% ] 10/10 VUs  1m16.9s/2m05.0s

running (1m18.0s), 10/10 VUs, 1410 complete and 0 interrupted iterations
upload   [  62% ] 10/10 VUs  1m17.9s/2m05.0s

running (1m19.0s), 10/10 VUs, 1430 complete and 0 interrupted iterations
upload   [  63% ] 10/10 VUs  1m18.9s/2m05.0s

running (1m20.0s), 10/10 VUs, 1450 complete and 0 interrupted iterations
upload   [  64% ] 10/10 VUs  1m19.9s/2m05.0s

running (1m21.0s), 10/10 VUs, 1470 complete and 0 interrupted iterations
upload   [  65% ] 10/10 VUs  1m20.9s/2m05.0s

running (1m22.0s), 10/10 VUs, 1490 complete and 0 interrupted iterations
upload   [  66% ] 10/10 VUs  1m21.9s/2m05.0s

running (1m23.0s), 10/10 VUs, 1510 complete and 0 interrupted iterations
upload   [  66% ] 10/10 VUs  1m22.9s/2m05.0s

running (1m24.0s), 10/10 VUs, 1530 complete and 0 interrupted iterations
upload   [  67% ] 10/10 VUs  1m23.9s/2m05.0s

running (1m25.0s), 10/10 VUs, 1550 complete and 0 interrupted iterations
upload   [  68% ] 10/10 VUs  1m24.9s/2m05.0s

running (1m26.0s), 10/10 VUs, 1570 complete and 0 interrupted iterations
upload   [  69% ] 10/10 VUs  1m25.9s/2m05.0s

running (1m27.0s), 10/10 VUs, 1590 complete and 0 interrupted iterations
upload   [  70% ] 10/10 VUs  1m26.9s/2m05.0s

running (1m28.0s), 10/10 VUs, 1610 complete and 0 interrupted iterations
upload   [  70% ] 10/10 VUs  1m27.9s/2m05.0s

running (1m29.0s), 10/10 VUs, 1630 complete and 0 interrupted iterations
upload   [  71% ] 10/10 VUs  1m28.9s/2m05.0s

running (1m30.0s), 10/10 VUs, 1650 complete and 0 interrupted iterations
upload   [  72% ] 10/10 VUs  1m29.9s/2m05.0s

running (1m31.0s), 10/10 VUs, 1670 complete and 0 interrupted iterations
upload   [  73% ] 10/10 VUs  1m30.9s/2m05.0s

running (1m32.0s), 10/10 VUs, 1686 complete and 0 interrupted iterations
upload   [  74% ] 10/10 VUs  1m31.9s/2m05.0s

running (1m33.0s), 10/10 VUs, 1706 complete and 0 interrupted iterations
upload   [  74% ] 10/10 VUs  1m32.9s/2m05.0s

running (1m34.0s), 10/10 VUs, 1726 complete and 0 interrupted iterations
upload   [  75% ] 10/10 VUs  1m33.9s/2m05.0s

running (1m35.0s), 10/10 VUs, 1746 complete and 0 interrupted iterations
upload   [  76% ] 10/10 VUs  1m34.9s/2m05.0s

running (1m36.0s), 10/10 VUs, 1766 complete and 0 interrupted iterations
upload   [  77% ] 10/10 VUs  1m35.9s/2m05.0s

running (1m37.0s), 10/10 VUs, 1786 complete and 0 interrupted iterations
upload   [  78% ] 10/10 VUs  1m36.9s/2m05.0s

running (1m38.0s), 10/10 VUs, 1800 complete and 0 interrupted iterations
upload   [  78% ] 10/10 VUs  1m37.9s/2m05.0s

running (1m39.0s), 10/10 VUs, 1820 complete and 0 interrupted iterations
upload   [  79% ] 10/10 VUs  1m38.9s/2m05.0s

running (1m40.0s), 10/10 VUs, 1840 complete and 0 interrupted iterations
upload   [  80% ] 10/10 VUs  1m39.9s/2m05.0s

running (1m41.0s), 10/10 VUs, 1860 complete and 0 interrupted iterations
upload   [  81% ] 10/10 VUs  1m40.9s/2m05.0s

running (1m42.0s), 10/10 VUs, 1880 complete and 0 interrupted iterations
upload   [  82% ] 10/10 VUs  1m41.9s/2m05.0s

running (1m43.0s), 10/10 VUs, 1900 complete and 0 interrupted iterations
upload   [  82% ] 10/10 VUs  1m42.9s/2m05.0s

running (1m44.0s), 10/10 VUs, 1920 complete and 0 interrupted iterations
upload   [  83% ] 10/10 VUs  1m43.9s/2m05.0s

running (1m45.0s), 10/10 VUs, 1940 complete and 0 interrupted iterations
upload   [  84% ] 10/10 VUs  1m44.9s/2m05.0s

running (1m46.0s), 10/10 VUs, 1960 complete and 0 interrupted iterations
upload   [  85% ] 10/10 VUs  1m45.9s/2m05.0s

running (1m47.0s), 10/10 VUs, 1980 complete and 0 interrupted iterations
upload   [  86% ] 10/10 VUs  1m46.9s/2m05.0s

running (1m48.0s), 10/10 VUs, 2000 complete and 0 interrupted iterations
upload   [  86% ] 10/10 VUs  1m47.9s/2m05.0s

running (1m49.0s), 10/10 VUs, 2020 complete and 0 interrupted iterations
upload   [  87% ] 10/10 VUs  1m48.9s/2m05.0s

running (1m50.0s), 10/10 VUs, 2040 complete and 0 interrupted iterations
upload   [  88% ] 10/10 VUs  1m49.9s/2m05.0s

running (1m51.0s), 10/10 VUs, 2060 complete and 0 interrupted iterations
upload   [  89% ] 10/10 VUs  1m50.9s/2m05.0s

running (1m52.0s), 09/10 VUs, 2080 complete and 0 interrupted iterations
upload   [  90% ] 09/10 VUs  1m51.9s/2m05.0s

running (1m53.0s), 09/10 VUs, 2098 complete and 0 interrupted iterations
upload   [  90% ] 09/10 VUs  1m52.9s/2m05.0s

running (1m54.0s), 08/10 VUs, 2111 complete and 0 interrupted iterations
upload   [  91% ] 08/10 VUs  1m53.9s/2m05.0s

running (1m55.0s), 07/10 VUs, 2127 complete and 0 interrupted iterations
upload   [  92% ] 07/10 VUs  1m54.9s/2m05.0s

running (1m56.0s), 07/10 VUs, 2141 complete and 0 interrupted iterations
upload   [  93% ] 07/10 VUs  1m55.9s/2m05.0s

running (1m57.0s), 06/10 VUs, 2154 complete and 0 interrupted iterations
upload   [  94% ] 06/10 VUs  1m56.9s/2m05.0s

running (1m58.0s), 05/10 VUs, 2166 complete and 0 interrupted iterations
upload   [  94% ] 05/10 VUs  1m57.9s/2m05.0s

running (1m59.0s), 05/10 VUs, 2175 complete and 0 interrupted iterations
upload   [  95% ] 05/10 VUs  1m58.9s/2m05.0s

running (2m00.0s), 04/10 VUs, 2185 complete and 0 interrupted iterations
upload   [  96% ] 04/10 VUs  1m59.9s/2m05.0s

running (2m01.0s), 03/10 VUs, 2193 complete and 0 interrupted iterations
upload   [  97% ] 03/10 VUs  2m00.9s/2m05.0s

running (2m02.0s), 03/10 VUs, 2199 complete and 0 interrupted iterations
upload   [  98% ] 03/10 VUs  2m01.9s/2m05.0s

running (2m03.0s), 02/10 VUs, 2204 complete and 0 interrupted iterations
upload   [  98% ] 02/10 VUs  2m02.9s/2m05.0s

running (2m04.0s), 01/10 VUs, 2208 complete and 0 interrupted iterations
upload   [  99% ] 01/10 VUs  2m03.9s/2m05.0s

running (2m05.0s), 01/10 VUs, 2210 complete and 0 interrupted iterations
upload   [ 100% ] 01/10 VUs  2m04.9s/2m05.0s


  █ THRESHOLDS 

    http_req_duration{endpoint:upload}
    ✓ 'p(99)<60000' p(99)=14.55ms


  █ TOTAL RESULTS 

    checks_total.......: 2211    17.651757/s
    checks_succeeded...: 100.00% 2211 out of 2211
    checks_failed......: 0.00%   0 out of 2211

    ✓ upload accepted (200)

    HTTP
    http_req_duration..............: avg=10.7ms   min=6.6ms   med=10.57ms  max=50.75ms  p(90)=12.42ms  p(95)=13.05ms
      { endpoint:upload }..........: avg=10.69ms  min=7.72ms  med=10.57ms  max=18.39ms  p(90)=12.41ms  p(95)=13.05ms
      { expected_response:true }...: avg=10.7ms   min=7.72ms  med=10.57ms  max=50.75ms  p(90)=12.42ms  p(95)=13.05ms
    http_req_failed................: 0.04%  1 out of 2213
    http_reqs......................: 2213   17.667724/s

    EXECUTION
    iteration_duration.............: avg=511.19ms min=507.9ms med=511.09ms max=519.08ms p(90)=512.89ms p(95)=513.6ms
    iterations.....................: 2211   17.651757/s
    vus............................: 1      min=0         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 1.2 MB 9.5 kB/s
    data_sent......................: 146 MB 1.2 MB/s



running (2m05.3s), 00/10 VUs, 2211 complete and 0 interrupted iterations
upload ✓ [ 100% ] 00/10 VUs  2m5s